## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/c55513c3-2b33-46e4-9461-2fb32c6eae02).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/core | Success :thumbsup:
**Dir**: layers/core
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmp5epvb7kp/plan`

```diff
2024-12-02T21:53:03.604Z [INFO]  OpenTofu version: 1.8.4
2024-12-02T21:53:03.604Z [DEBUG] using github.com/hashicorp/go-tfe v1.36.0
2024-12-02T21:53:03.604Z [DEBUG] using github.com/opentofu/hcl/v2 v2.0.0-20240416130056-03228b26f391
2024-12-02T21:53:03.604Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.1
2024-12-02T21:53:03.604Z [DEBUG] using github.com/zclconf/go-cty v1.14.4
2024-12-02T21:53:03.604Z [INFO]  Go runtime version: go1.21.11
2024-12-02T21:53:03.604Z [INFO]  CLI args: []string{"/usr/local/lib/tofuenv/versions/1.8.4/tofu", "show", "/tmp/tmp5epvb7kp/plan"}
2024-12-02T21:53:03.604Z [DEBUG] Attempting to open CLI config file: /github/home/.tofurc
2024-12-02T21:53:03.604Z [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2024-12-02T21:53:03.604Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2024-12-02T21:53:03.604Z [DEBUG] ignoring non-existing provider search directory /github/home/.terraform.d/plugins
2024-12-02T21:53:03.604Z [DEBUG] ignoring non-existing provider search directory /github/home/.local/share/terraform/plugins
2024-12-02T21:53:03.605Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2024-12-02T21:53:03.605Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2024-12-02T21:53:03.605Z [DEBUG] Found the config directory: /github/home/.terraform.d
2024-12-02T21:53:03.605Z [INFO]  CLI command args: []string{"show", "/tmp/tmp5epvb7kp/plan"}
2024-12-02T21:53:03.699Z [DEBUG] checking for provisioner in "."
2024-12-02T21:53:03.699Z [DEBUG] checking for provisioner in "/usr/local/lib/tofuenv/versions/1.8.4"
2024-12-02T21:53:03.699Z [DEBUG] created provider logger: level=debug
2024-12-02T21:53:03.699Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:53:03.713Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 args=[".terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0"]
2024-12-02T21:53:03.714Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=814
2024-12-02T21:53:03.714Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0
2024-12-02T21:53:03.724Z [INFO]  provider.terraform-provider-cloudflare_v4.47.0: configuring server automatic mTLS: timestamp=2024-12-02T21:53:03.724Z
2024-12-02T21:53:03.738Z [DEBUG] provider: using plugin: version=6
2024-12-02T21:53:03.738Z [DEBUG] provider.terraform-provider-cloudflare_v4.47.0: plugin address: address=/tmp/plugin416646922 network=unix timestamp=2024-12-02T21:53:03.738Z
2024-12-02T21:53:03.776Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:53:03.778Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=814
2024-12-02T21:53:03.778Z [DEBUG] provider: plugin exited
2024-12-02T21:53:03.778Z [DEBUG] created provider logger: level=debug
2024-12-02T21:53:03.778Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:53:03.784Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null args=[".terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null"]
2024-12-02T21:53:03.784Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=823
2024-12-02T21:53:03.784Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null
2024-12-02T21:53:03.787Z [INFO]  provider.terraform-provider-null: configuring server automatic mTLS: timestamp=2024-12-02T21:53:03.787Z
2024-12-02T21:53:03.802Z [DEBUG] provider.terraform-provider-null: plugin address: address=/tmp/plugin2576095421 network=unix timestamp=2024-12-02T21:53:03.802Z
2024-12-02T21:53:03.802Z [DEBUG] provider: using plugin: version=5
2024-12-02T21:53:03.813Z [DEBUG] No provider meta schema returned
2024-12-02T21:53:03.814Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:53:03.814Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=823
2024-12-02T21:53:03.814Z [DEBUG] provider: plugin exited
2024-12-02T21:53:03.814Z [DEBUG] created provider logger: level=debug
2024-12-02T21:53:03.815Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:53:03.820Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 args=[".terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1"]
2024-12-02T21:53:03.820Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=831
2024-12-02T21:53:03.820Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1
2024-12-02T21:53:03.869Z [INFO]  provider.terraform-provider-akash_v0.1.1: configuring server automatic mTLS: timestamp=2024-12-02T21:53:03.869Z
2024-12-02T21:53:03.888Z [DEBUG] provider: using plugin: version=5
2024-12-02T21:53:03.888Z [DEBUG] provider.terraform-provider-akash_v0.1.1: plugin address: network=unix address=/tmp/plugin4267698504 timestamp=2024-12-02T21:53:03.888Z
2024-12-02T21:53:03.907Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:53:04.071Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x8b     \xff\x94V[h\xd7\xeeJ\xbb\xd2\xd1겿V\xd2\xea\xd7\xea6:\x92\xed\xd5ƚ\xd1Y\xb6\x958\xaem٭\xdb\xd4ET~A\xcf\xad\xcf\xcelgf\xd7\xd6\xdbRڐ\xd2)-\xa4Pz	u^;ũK\xc0\xa4\xc1\xa4\xa1$Ԥ\x81\xdam\xa0\xd0R\x83q\xa8	!\x94ƭ\xfd\xa0r\xce\xec\xcd\xf6Z\xb1$f\xe7\xbb\xfd\xe7?\xe7\xfc\xbbG\xaf\\xff\xef\xd9\xf7\xff\xfa\xf7g1&!h\x89\x86I+\x84\x97n\xfe\xe6\x87\xcf|]>>S>w-L\x81\x84\xf0\xda\xef\xb6\xd2	\xc1\x8d8\x84҄\x84 \x82\xa5\x8d\x90|\xe7\x9bl\xa5a\xd2\xa7\xa9P}YZ\xa0\xdb\x92&\xa4:\xb0C\x89R \xadx\xe5\xa5\xcb\xc2&?IV:\xb1S\xe9\xa2	\xc67\xce\xffI`\xf8^\x88\x86I<)\xe8\xc6n\xa5+MH\xf4`\x8f\xa3@"\xf8\xdd7$\xb7\xbd\xea\xd3\x80 \xb16|\xf1\xc6U\xe1C\xe0\xdb-ҁ@/\xf6*q\x9a \xed\xf8\x87^\xa5v \xd0\x89\xc2GAЇ}J\x9a\x90(\xe0\x80\xa71B\xf0\xd5\xf7$\xb7li\xd3		L(q
2024-12-02T21:53:04.071Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xa4?\xfe\xf4C\xd1\xafvI\xacqPA#Q<\xf7\xb73&ݐ\x91P7ᐒ\xa4@:\xf1⅗"4Bz\xe0|PY\xe3\xb02B\x81tỿ:+\xb0\xbc`1\xc5Qe\x8c\xe9\xc6\xd7߼ 0\x80ׂz\xc6q\Qh\x8c\xf4\xe0\xd9\xf3D\/\x94d\/L\xe0\x84\x84bx\xe3\xdc'\xdd4L\xe2lY(Re\x92<\xf5-4B\xfa\xe0v\xe0\xd8S8\xa5l\x8bAĞG!\xd4\xd2\x8e\xb4\xb5\x93\x8ehgWwO(\x90^\xbcX~G\xac\xbbn\x85eZ?l\xc7\xedJM\x908\x9e\xb9tY\xb4v \!	\xf8w`< ;p\x87<	HaJ\xe9\xa2@\xfa\xf0g\xcac0\xbf;\xd38-\xb1~|\xb6qki\x8c\xe0\x8bW\xaeg\x84\xa2EHcZy\x84&H\xdf|\x86`\x92FH\xfe\xd8\xc1Nܩ<\x92&$	38\xa3\xa8\xc8 ~\xe7\xd6\xffD\xf1\xc3\xf0J\xc05\x89!ީ\xee\x8c\xe8~<Q\xedBwo\xbc\xaf 1\x88\xd5\xe1\xcf\xffTtn>8\xb38\xabdh\x82$\xf1\xed\xb7dF\x81\xc9l\x8cQ`\xc8B\x81\xe3\xf7\xab\xffy\x84(\x90|\xeb\xb5[\xa2\xaa1\xf88h\xe9\xccᜲ\x8b\xc6\xc8(~\xeb/\x9f\x8aՍ\xc3~\xb9\xf0q\x98\xc7y	\x8d\xe1\xaf_\xf9\x8f\x80\xd8-!v\xe3ne2\x8e\xef\xfd\xfe#\xe18:%6{q\xaf\xb2@G\x89\x82?:s=L#\x84(\x8d\x90I\xb8\xa5a2\x88;M\xe1Q|TYH2	\x8f\xe1c\xf2i
2024-12-02T21:53:04.071Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xf6\xe1>\xe5q
2024-12-02T21:53:04.071Z [DEBUG] provider.terraform-provider-akash_v0.1.1: d/^\xba-\xc4\xdb\xe0\xf9`a\xdb`?\xeeW>O\x81P\xfcݵ\x9f\x88#\xba\xee\xb4\xc9\xd0\xedp ()\x90I\xfc\xed\xdb\xef\xd88\x84\x87$6\x85o\xffYb)\xb8`)X\xc4E\xe5`\xc3AJ\xf7\xb7\xb5\x93\x91ѱqe\x82NN%\x81\x84\xa0\.\xb7`\xf9\xd2'ݩ\xc3{C\xc9~\xd2\xe5K\xffz\xf9\xf2\xc68\x96\xcb7_\xbe\xbc1\x9e:\x92L\x92V(\x97\xcbw66666BX\xfee\xf51\xf5\xf69\xd6\xee\xe9\xf9\x82\xc5=1\x9c\xa2\xed\xb3V\xa3Pd\x9d\xb6n;7;뱔\xe1\xae|G\xe3\x96e|\xd3\xd0L\xdb箭[ڪ\xa9\xfbja\x9ee\x96\xbfQ\xd4]\xcev\x9b1\xb5\xc2<ˬ\xcd\xee]j\xceas\xc6fl5\x95^\x9ag\x99#\xcfs۟V+\xdb6Ɉ\xad{\xc9.q\xd7\xa8\xf2MI쁕ئ\xe7s\xa3\xb2\x80%\xc7\xe5\x9fX\xf7\xb9\xc7v|\x86\xa6V\xff\xd6\xccI\xf3\x89{\xccU\xd1o\xdc9\xb8\xbajڜ\xdeC\xa9\xe5ݻ\xc7R\xbbXtK\]6tKw\xe9?V\xb4|\x86U#\xeb\xe9\xaag\xe6\xec/r\x9b\xbb\xa6\xc1-\xc0s\xebm|-l\xb8\xf1U\xc0\\xb1\xdd\xcb\xdf\xcf_6s6o䋾\xbafI\xf7\xf9|}: \x8cV\xa7\xe7g\xd4E\x97\xeb>_\xe4\xaeo\xae\x9a\x86\xees\xd6\xd7 \x9c\x9c\xc3ə\xfeZ\xf1\x84j8ymM\xf7\xd6L\xc3qZΙ)XŜi\xab9nsW\x8c\xd8\xcc\xe6\xe4\xa5\x8c\xbaKݥ\xe5}\xcb\xdeS\x9b\xd3\xd5e\xee\x968\xd36gUM=Av\x85\xed\xa1\xa6\x9f\xbb\xae\xbe\xea\xb8\xf9J\xe539G\xf3W\xae\xe3;\xa5y\xcd_\x9d\xaf\xa1\xc7\xd6\xe3@iV]P3ͬ\xb6^\x92\x97=\xa9\x95\x98Vim\xad\xa6\xa0\xa4\xc3WR\xe0q\xa0\xc4\xd4\xccu\xb6\xe2\x94"\x9a\xb3\xb0\x97\x8a\xbaғ\x8e\xbcnڪ\xf8ǔ\x86n\xbaN\xc9\xccrwF?\xa9{k\x9a\x80EN\x97[\xb4}3\xcf~\xac\xf2I+\xb8\x8e!\xe0\xcd\x94\xbcWǊ\x9b\xad\xc9\xd5{\x86\x9fP<x\6\x9b7\x87\x9d\xe2	\x8b\xb3=\x8ci&
2024-12-02T21:53:04.073Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xae\xba\xbc\xe6wݨ\x82\xeez\xfc\xc8b\xfd\xda\xdd}\xa3<nȡ{\x97f\xe9>M\xb2R\x8b\xb8#ұ\xc1\xaf:$|\xcb\xa2\x91\x89\xfa\x93\xf3\xb3O\xf0\xf5%\xddtkW\xf3<\x9fwJ\x9cV\xb7\xa0\xf2bE\xcfgw\xefR\xbd-\xf6x\x99\xfb\xec\xf1\x86\xccT:\xb87Gu;\xeb\xad\xe9'\xf9\xb2\xaf\xfb\xfc\xf8W\x963sӪ\xc7\xed\xac<\xbcn㜙\xaa˵\xb5\xaal%\xb0Y\xf1-/3\xa7\xe6\x96\xa9\xb36\xa9Y0z\x97dѱmQ\x82[\xe2\xf5\xea\xd8X\x9ds_\xb8\x88\x9d\xac\xe3j\xaa\xe2QKXtl\x9f\x9f\xf6Y\xbcN\xd2ǖ\xbe\x99\xb0֔\xaap\xa4.\xac\xb9\xd7Hl\xceqr\x96\xb8\xa6\x96n\xe7T\xc7\xcdi9\xb7`h\x86˳\xdc\xf6M\xdd*\xdf\xf2]\x9e\xf5\xa6\x83kٰ\xb6Ls\xbd\x9c\x90{\xd5\xd9F\x9f\xea\xf1\xd9\xd7\R\xff\xf1⻺\xed\xd7W\xbf\xcaO{y\xbc\xfa\x8al\xae\xae\x9a՟@5m\xcd\xf7\xac\xb2٢߬\xb9\x85\x9aJaӪ\xcdO=~|\x89\xd5cS\xcd5\xb5\xd8\xe0(	w\xb59\xb3\xc1]\xec\xadſ\xa6\x9fǅ\xed\xfcL\xbe\xacJ]-\xda\xc6{.T\xf9n\xd2N9\xeeI\xaf\xa0\\xb3\xf4u\xee\x8aS\xe1rM\xadMI1\xf7\xe4\x94\xf44\x97\xe7L\xcfw\xd7\xeb\xa0j:\x9aU\xcc\xf3S\xfc\x84\xd1Y5\xa3f4˴\x8b\xa7\x83k\xda\xf8\xedu׼])I.k{\xaa\x94\xf5\x9c\xa7Y\xf4\xa9\x92\xb7\xee\xbae=\xfd\xff   \xff\xff\x8a\xf6\xc4z\xaf  
2024-12-02T21:53:04.073Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=831
2024-12-02T21:53:04.073Z [DEBUG] provider: plugin exited

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
